# Lesson 1


# 1.1
# Напишите и запустите программу. которая выводит строку  "Hello world!"
print('Hello world!')

# Напишите программу, которая на входе получает имя пользователя,
# cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
user_name = input()
print(f'Hello {user_name}!')

# Напишите программу, которая на входе получает 2 числа,
# производит с ними арифметическую операцию(на ваше усмотрение),
# и выводит “Результат = {результат}”.
a = int(input())
b = int(input())
sum = a + b
print(sum)

# 1.2
# Напишите
# программу, чтобы
# вывести:
#
# ** ** ** ** *
# * *
# * *
# ** ** ** ** *

print('** ** ** ** * \n'
      '* * \n'
      '* * \n'
      '** ** ** ** *')

